gsdstr/stm32l-coocox/firmware/components/Third_Party/STM32L152L-Discovery/stm32l152l_discovery_glass_lcd.c
/**
  ******************************************************************************
  * @file    stm32l152c_discovery_glass_lcd.c
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    5-September-2014
  * @brief   This file includes the LCD Glass driver for LCD Module of 
  *          STM32L152C-Discovery board.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm32l152l_discovery_glass_lcd.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32L152C_DISCOVERY
  * @{
  */
  
/** @defgroup STM32L152C_DISCOVERY_GLASS_LCD STM32L152C-Discovery Glass LCD
  * @brief This file includes the LCD Glass driver for LCD Module of 
  *        STM32L152C-DISCOVERY board.
  * @{
  */ 

/** @defgroup STM32L152C_DISCOVERY_GLASS_LCD_Private_Defines Private Defines
  * @{
  */
#define ASCII_CHAR_0                  0x30  /* 0 */
#define ASCII_CHAR_AT_SYMBOL          0x40  /* @ */
#define ASCII_CHAR_LEFT_OPEN_BRACKET  0x5B  /* [ */
#define ASCII_CHAR_APOSTROPHE         0x60  /* ` */
#define ASCII_CHAR_LEFT_OPEN_BRACE    0x7B  /* ( */
/**
  * @}
  */   


/** @defgroup STM32L152C_DISCOVERY_GLASS_LCD_Private_Variables Private Variables
  * @{
  */ 

/* this variable can be used for accelerate the scrolling exit when push user button */
__IO uint8_t bLCDGlass_KeyPressed = 0; 

/**
  @verbatim
================================================================================
                              GLASS LCD MAPPING
================================================================================
      A
     _  ----------
COL |_| |\   |J  /|
       F| H  |  K |B
     _  |  \ | /  |
COL |_| --G-- --M--
        |   /| \  |
       E|  Q |  N |C
     _  | /  |P  \|   
DP  |_| -----------  
      D         

 An LCD character coding is based on the following matrix:
      { E , D , P , N   }
      { M , C , COL , DP}
      { B , A , K , J   }
      { G , F , Q , H   }

 The character 'A' for example is:
  -------------------------------
LSB   { 1 , 0 , 0 , 0   }
      { 1 , 1 , 0 , 0   }
      { 1 , 1 , 0 , 0   }
MSB   { 1 , 1 , 0 , 0   }
      -------------------
  'A' =  F    E   0   0 hexa

  @endverbatim
*/

LCD_HandleTypeDef LCDHandle;

/* Constant table for cap characters 'A' --> 'Z' */
const uint16_t CapLetterMap[26]=
    {
        /* A      B      C      D      E      F      G      H      I  */
        0xFE00,0x6714,0x1d00,0x4714,0x9d00,0x9c00,0x3f00,0xfa00,0x0014,
        /* J      K      L      M      N      O      P      Q      R  */
        0x5300,0x9841,0x1900,0x5a48,0x5a09,0x5f00,0xFC00,0x5F01,0xFC01,
        /* S      T      U      V      W      X      Y      Z  */
        0xAF00,0x0414,0x5b00,0x18c0,0x5a81,0x00c9,0x0058,0x05c0
    };

/* Constant table for number '0' --> '9' */
const uint16_t NumberMap[10]=
    {
        /* 0      1      2      3      4      5      6      7      8      9  */
        0x5F00,0x4200,0xF500,0x6700,0xEa00,0xAF00,0xBF00,0x04600,0xFF00,0xEF00
    };

uint32_t Digit[4];     /* Digit frame buffer */

/* LCD BAR status: To save the bar setting after writing in LCD RAM memory */
uint8_t LCDBar = BATTERYLEVEL_FULL;

/**
  * @}
  */

/** @defgroup STM32L152C_DISCOVERY_LCD_Private_Functions Private Functions
  * @{
  */
static void Convert(uint8_t* Char, Point_Typedef Point, DoublePoint_Typedef DoublePoint);
static void LCD_MspInit(LCD_HandleTypeDef *hlcd);

/**
  * @}
  */ 

/** @defgroup STM32L152C_DISCOVERY_LCD_Exported_Functions Exported Functions
  * @{
  */ 

/**
  * @brief  Configures the LCD GLASS relative GPIO port IOs and LCD peripheral.
  * @retval None
  */
void BSP_LCD_GLASS_Init(void)
{
  LCDHandle.Instance              = LCD;
  LCDHandle.Init.Prescaler        = LCD_PRESCALER_1;
  LCDHandle.Init.Divider          = LCD_DIVIDER_31;
  LCDHandle.Init.Duty             = LCD_DUTY_1_4;
  LCDHandle.Init.Bias             = LCD_BIAS_1_3;
  LCDHandle.Init.VoltageSource    = LCD_VOLTAGESOURCE_INTERNAL;
  LCDHandle.Init.Contrast         = LCD_CONTRASTLEVEL_4;
  LCDHandle.Init.DeadTime         = LCD_DEADTIME_0;
  LCDHandle.Init.PulseOnDuration  = LCD_PULSEONDURATION_4;
  LCDHandle.Init.BlinkMode        = LCD_BLINKMODE_OFF;
  LCDHandle.Init.BlinkFrequency   = LCD_BLINKFREQUENCY_DIV32;
  LCDHandle.Init.MuxSegment       = LCD_MUXSEGMENT_ENABLE;
  
  /* Initialize the LCD */
  LCD_MspInit(&LCDHandle);
  HAL_LCD_Init(&LCDHandle);

  BSP_LCD_GLASS_Clear();
}

/**
  * @brief  Configures the LCD Blink mode and Blink frequency.
  * @param  BlinkMode: specifies the LCD blink mode.
  *   This parameter can be one of the following values:
  *     @arg LCD_BLINKMODE_OFF:           Blink disabled
  *     @arg LCD_BLINKMODE_SEG0_COM0:     Blink enabled on SEG[0], COM[0] (1 pixel)
  *     @arg LCD_BLINKMODE_SEG0_ALLCOM:   Blink enabled on SEG[0], all COM (up to 8 
  *                                       pixels according to the programmed duty)
  *     @arg LCD_BLINKMODE_ALLSEG_ALLCOM: Blink enabled on all SEG and all COM 
  *                                       (all pixels)
  * @param  BlinkFrequency: specifies the LCD blink frequency.
  *     @arg LCD_BLINKFREQUENCY_DIV8:    The Blink frequency = fLcd/8
  *     @arg LCD_BLINKFREQUENCY_DIV16:   The Blink frequency = fLcd/16
  *     @arg LCD_BLINKFREQUENCY_DIV32:   The Blink frequency = fLcd/32
  *     @arg LCD_BLINKFREQUENCY_DIV64:   The Blink frequency = fLcd/64 
  *     @arg LCD_BLINKFREQUENCY_DIV128:  The Blink frequency = fLcd/128
  *     @arg LCD_BLINKFREQUENCY_DIV256:  The Blink frequency = fLcd/256
  *     @arg LCD_BLINKFREQUENCY_DIV512:  The Blink frequency = fLcd/512
  *     @arg LCD_BLINKFREQUENCY_DIV1024: The Blink frequency = fLcd/1024
  * @retval None
  */
void BSP_LCD_GLASS_BlinkConfig(uint32_t BlinkMode, uint32_t BlinkFrequency)
{
  __HAL_LCD_BLINK_CONFIG(&LCDHandle, BlinkMode, BlinkFrequency);
}

/**
  * @brief  LCD contrast setting
  * @param  Contrast: specifies the LCD Contrast.
  *   This parameter can be one of the following values:
  *     @arg LCD_CONTRASTLEVEL_0: Maximum Voltage = 2.60V
  *     @arg LCD_CONTRASTLEVEL_1: Maximum Voltage = 2.73V
  *     @arg LCD_CONTRASTLEVEL_2: Maximum Voltage = 2.86V
  *     @arg LCD_CONTRASTLEVEL_3: Maximum Voltage = 2.99V
  *     @arg LCD_CONTRASTLEVEL_4: Maximum Voltage = 3.12V
  *     @arg LCD_CONTRASTLEVEL_5: Maximum Voltage = 3.25V
  *     @arg LCD_CONTRASTLEVEL_6: Maximum Voltage = 3.38V
  *     @arg LCD_CONTRASTLEVEL_7: Maximum Voltage = 3.51V
  * @retval None
  */
void BSP_LCD_GLASS_Contrast(uint32_t Contrast)
{
  __HAL_LCD_CONTRAST_CONFIG(&LCDHandle, Contrast);
}

/**
  * @brief  This function writes a char in the LCD frame buffer.
  * @param  ch: the character to display.
  * @param Point: a point to add in front of char
  *         This parameter can be: POINT_OFF or POINT_ON
  * @param Column: flag indicating if a column has to be add in front
  *         of displayed character.
  *         This parameter can be: DOUBLEPOINT_OFF or DOUBLEPOINT_ON.           
  * @param Position: position in the LCD of the caracter to write [1:6]
  * @retval None
  * @note  Required preconditions: The LCD should be cleared before to start the
  *         write operation.  
  */
void BSP_LCD_GLASS_WriteChar(uint8_t* ch, uint8_t Point, uint8_t Column, uint8_t Position)
{
  /* To convert displayed character in segment in array digit */
  Convert(ch, (Point_Typedef)Point, (DoublePoint_Typedef)Column);

  switch (Position)
  {
    /* Position 1 on LCD (Digit1)*/
    case 1:
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xcffffffc, ((Digit[0]& 0x0c) << 26 ) | (Digit[0]& 0x03)) ; /* 1G 1B 1M 1E */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xcffffffc, ((Digit[1]& 0x0c) << 26 ) | (Digit[1]& 0x03)) ; /* 1F 1A 1C 1D  */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xcffffffc, ((Digit[2]& 0x0c) << 26 ) | (Digit[2]& 0x03)) ; /* 1Q 1K 1Col 1P  */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xcffffffc, ((Digit[3]& 0x0c) << 26 ) | (Digit[3]& 0x03)) ; /* 1H 1J 1DP 1N  */
      break;

    /* Position 2 on LCD (Digit2)*/
    case 2:
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xf3ffff03, ((Digit[0]& 0x0c) << 24 )|((Digit[0]& 0x02) << 6 )|((Digit[0]& 0x01) << 2 )) ; /* 2G 2B 2M 2E  */   
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xf3ffff03, ((Digit[1]& 0x0c) << 24 )|((Digit[1]& 0x02) << 6 )|((Digit[1]& 0x01) << 2 )) ; /* 2F 2A 2C 2D */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xf3ffff03, ((Digit[2]& 0x0c) << 24 )|((Digit[2]& 0x02) << 6 )|((Digit[2]& 0x01) << 2 )) ; /* 2Q 2K 2Col 2P */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xf3ffff03, ((Digit[3]& 0x0c) << 24 )|((Digit[3]& 0x02) << 6 )|((Digit[3]& 0x01) << 2 )) ; /* 2H 2J 2DP 2N */
      break;
    
    /* Position 3 on LCD (Digit3)*/
    case 3:
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xfcfffcff, ((Digit[0]& 0x0c) << 22 ) | ((Digit[0]& 0x03) << 8 )) ; /* 3G 3B 3M 3E  */ 
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xfcfffcff, ((Digit[1]& 0x0c) << 22 ) | ((Digit[1]& 0x03) << 8 )) ; /* 3F 3A 3C 3D */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xfcfffcff, ((Digit[2]& 0x0c) << 22 ) | ((Digit[2]& 0x03) << 8 )) ; /* 3Q 3K 3Col 3P */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xfcfffcff, ((Digit[3]& 0x0c) << 22 ) | ((Digit[3]& 0x03) << 8 )) ; /* 3H 3J 3DP 3N */
      break;
    
    /* Position 4 on LCD (Digit4)*/
    case 4:
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xffcff3ff, ((Digit[0]& 0x0c) << 18 ) | ((Digit[0]& 0x03) << 10 )) ; /* 4G 4B 4M 4E */  
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xffcff3ff, ((Digit[1]& 0x0c) << 18 ) | ((Digit[1]& 0x03) << 10 )) ; /* 4F 4A 4C 4D */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xffcff3ff, ((Digit[2]& 0x0c) << 18 ) | ((Digit[2]& 0x03) << 10 )) ; /* 4Q 4K 4Col 4P */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xffcff3ff, ((Digit[3]& 0x0c) << 18 ) | ((Digit[3]& 0x03) << 10 )) ; /* 4H 4J 4DP 4N */
      break;
    
