gsdstr/stm32l-coocox/firmware/components/Third_Party/STM32L152L-Discovery/stm32l152l_discovery_glass_lcd.c
    /* Position 5 on LCD (Digit5)*/
    case 5:
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xfff3cfff, ((Digit[0]& 0x0c) << 16 ) | ((Digit[0]& 0x03) << 12 )) ; /* 5G 5B 5M 5E */  
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xfff3cfff, ((Digit[1]& 0x0c) << 16 ) | ((Digit[1]& 0x03) << 12 )) ; /* 5F 5A 5C 5D */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xfff3efff, ((Digit[2]& 0x0c) << 16 ) | ((Digit[2]& 0x01) << 12 )) ; /* 5Q 5K   5P */ 
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xfff3efff, ((Digit[3]& 0x0c) << 16 ) | ((Digit[3]& 0x01) << 12 )) ; /* 5H 5J   5N */
      break;
    
    /* Position 6 on LCD (Digit6)*/
    case 6:
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER0, 0xfffc3fff, ((Digit[0]& 0x04) << 15 ) | ((Digit[0]& 0x08) << 13 ) | ((Digit[0]& 0x03) << 14 )) ; /* 6B 6G 6M 6E */  
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER2, 0xfffc3fff, ((Digit[1]& 0x04) << 15 ) | ((Digit[1]& 0x08) << 13 ) | ((Digit[1]& 0x03) << 14 )) ; /* 6A 6F 6C 6D */
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xfffc3fff, ((Digit[2]& 0x04) << 15 ) | ((Digit[2]& 0x08) << 13 ) | ((Digit[2]& 0x01) << 14 )) ; /* 6K 6Q    6P */ 
      HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xfffc3fff, ((Digit[3]& 0x04) << 15 ) | ((Digit[3]& 0x08) << 13 ) | ((Digit[3]& 0x01) << 14 )) ; /* 6J 6H   6N */
      break;
    
     default:
      break;
  }

  /* Refresh LCD  bar */
  BSP_LCD_GLASS_BarLevelConfig(LCDBar);

}

/**
  * @brief Setting bar on LCD, writes bar value in LCD frame buffer 
  * @param BarLevel: specifies the LCD GLASS Batery Level.
  *     This parameter can be one of the following values:
  *     @arg BATTERYLEVEL_OFF: LCD GLASS Batery Empty
  *     @arg BATTERYLEVEL_1_4: LCD GLASS Batery 1/4 Full
  *     @arg BATTERYLEVEL_1_2: LCD GLASS Batery 1/2 Full
  *     @arg BATTERYLEVEL_3_4: LCD GLASS Batery 3/4 Full
  *     @arg BATTERYLEVEL_FULL: LCD GLASS Batery Full
  * @retval None
  */
void BSP_LCD_GLASS_BarLevelConfig(uint8_t BarLevel)
{
  switch (BarLevel)
  {
  /* BATTERYLEVEL_OFF */
  case BATTERYLEVEL_OFF:
    /* Set BAR1 & BAR3 off  */
    HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xFFFF5FFF, 0 << (uint32_t)12);    
    /* Set BAR0 & BAR2 off  */
    HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xFFFF5FFF, 0 << (uint32_t)12);
    LCDBar = BATTERYLEVEL_OFF;
    break;
    
  /* BARLEVEL 1/4 */
  case BATTERYLEVEL_1_4:
    /* Set BAR1 & BAR3 off  */
    HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xFFFF5FFF, 0 << (uint32_t)12);    
    /* Set BAR0 on  */
    /* Set BAR2 off  */
    HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xFFFF5FFF, 8 << (uint32_t)12);
    LCDBar = BATTERYLEVEL_1_4;
    break;
    
  /* BARLEVEL 1/2 */
  case BATTERYLEVEL_1_2:
    /* Set BAR1 on  */
    /* Set BAR3 off  */
    HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xFFFF5FFF, 8 << (uint32_t)12);    
    /* Set BAR0 on  */
    /* Set BAR2 off  */
    HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xFFFF5FFF, 8 << (uint32_t)12);
    LCDBar = BATTERYLEVEL_1_2;
    break;
    
  /* Battery Level 3/4 */
  case BATTERYLEVEL_3_4:
    /* Set BAR1 on  */
    /* Set BAR3 off  */
    HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xFFFF5FFF, 8 << (uint32_t)12);    
    /* Set BAR0 on  */
    /* Set BAR2 on  */
    HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xFFFF5FFF, 10 << (uint32_t)12);
    LCDBar = BATTERYLEVEL_3_4;
    break;
    
  /* BATTERYLEVEL_FULL */
  case BATTERYLEVEL_FULL:
    /* Set BAR1 on  */
    /* Set BAR3 on  */
    HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER4, 0xFFFF5FFF, 10 << (uint32_t)12);    
    /* Set BAR0 on  */
    /* Set BAR2 on  */
    HAL_LCD_Write(&LCDHandle, LCD_RAM_REGISTER6, 0xFFFF5FFF, 10 << (uint32_t)12);
    LCDBar = BATTERYLEVEL_FULL;
    break;
    
  default:
    break;
  }
  
  /* Update the LCD display */
  HAL_LCD_UpdateDisplayRequest(&LCDHandle);
}


/**
  * @brief  This function writes a char in the LCD RAM.
  * @param  ch: The character to display.
  * @param  point: A point to add in front of char.
  *          This parameter  can be one of the following values:  
  *              @arg POINT_OFF: No point to add in front of char.
  *              @arg POINT_ON: Add a point in front of char.
  * @param  DoublePoint: Flag indicating if a apostrophe has to be add in front 
  *                     of displayed character.
  *          This parameter  can be one of the following values:
  *              @arg DOUBLEPOINT_OFF: No colon to add in back of char.
  *              @arg DOUBLEPOINT_ON: Add an colon in back of char.
  * @param  position: Position in the LCD of the caracter to write.
  *                   This parameter can be any value in range [1:6].
  * @retval None
  */
void BSP_LCD_GLASS_DisplayChar(uint8_t* ch, Point_Typedef point, DoublePoint_Typedef DoublePoint, uint8_t position)
{
  /*!< LCD Write Char */
  BSP_LCD_GLASS_WriteChar(ch, point, DoublePoint, position);

  /* Update the LCD display */
  HAL_LCD_UpdateDisplayRequest(&LCDHandle);
}

/**
  * @brief  This function writes a char in the LCD RAM.
  * @param  ptr: Pointer to string to display on the LCD Glass.
  * @retval None
  */
void BSP_LCD_GLASS_DisplayString(uint8_t* ptr)
{
  uint8_t position = 0x01;

  /* Send the string character by character on lCD */
  while ((*ptr != 0) & (position < 7))
  {
    /* Display one character on LCD */
    BSP_LCD_GLASS_WriteChar(ptr, 0, 0, position);

    /* Point on the next character */
    ptr++;

    /* Increment the character counter */
    position++;
  }


}

/**
  * @brief  This function writes a char in the LCD RAM.
  * @param  ptr: Pointer to string to display on the LCD Glass.
  * @retval None
  * @note Required preconditions: Char is ASCCI value "Ored" with decimal point or Column flag
  */
void BSP_LCD_GLASS_DisplayStrDeci(uint16_t* ptr)
{
  uint8_t index = 1;
  uint8_t tmpchar = 0;
  
  /* Send the string character by character on lCD */
  while((*ptr != 0) & (index < 7))
  {      
    tmpchar = (*ptr) & 0x00FF;
    
    switch((*ptr) & 0xF000)
    {
    case DOT:
      /* Display one character on LCD with decimal point */
      BSP_LCD_GLASS_WriteChar(&tmpchar, POINT_ON, DOUBLEPOINT_OFF, index);
      break;
    case DOUBLE_DOT:
      /* Display one character on LCD with decimal point */
      BSP_LCD_GLASS_WriteChar(&tmpchar, POINT_OFF, DOUBLEPOINT_ON, index);
      break;
    default:
      BSP_LCD_GLASS_WriteChar(&tmpchar, POINT_OFF, DOUBLEPOINT_OFF, index);    
      break;
    }/* Point on the next character */
    ptr++;
    
    /* Increment the character counter */
    index++;
  }
}

/**
  * @brief  This function Clear the whole LCD RAM.
  * @retval None
  */
void BSP_LCD_GLASS_Clear(void)
{
  HAL_LCD_Clear(&LCDHandle); 
}

/**
  * @brief  Display a string in scrolling mode
  * @param  ptr: Pointer to string to display on the LCD Glass.
  * @param  nScroll: Specifies how many time the message will be scrolled
  * @param  ScrollSpeed : Specifies the speed of the scroll, low value gives
  *         higher speed 
  * @retval None
  * @note    Required preconditions: The LCD should be cleared before to start the
  *         write operation.
  */
void BSP_LCD_GLASS_ScrollSentence(uint8_t* ptr, uint16_t nScroll, uint16_t ScrollSpeed)
{
  uint8_t repetition = 0, nbrchar = 0, sizestr = 0;
  uint8_t* ptr1;
  uint8_t str[6] = "";
  
  if(ptr == 0)
  {
    return;
  }
  
  /* To calculate end of string */
  for(ptr1 = ptr, sizestr = 0; *ptr1 != 0; sizestr++, ptr1++);
  
  ptr1 = ptr;
  
